Autodesk.Revit.DB.Structure.RebarConstraint.Create(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},System.Boolean,System.Double)
This method creates a constraint for a given RebarConstrainedHandle.
Using this method for Shape-Driven Rebar will throw exception. If you need a new RebarConstraint for a handle of a Shape-Driven Rebar, you can obtain a list of possible constraints using one of the RebarConstraintsManager.GetConstraintCandidatesForHandle functions, choose the desired one, and set it as preferred.
handle:
The handle of the rebar that will be constrained.
targetReferences:
The references to which the rebar handle will be constrained.
This collection must contain one or more references to faces of elements that can host rebar.
isConstraintToCover:
If true the RebarConstraintType will be set to ToCover, otherwise RebarConstraintType will be set to FixedDistanceToHostFace.
offsetValue:
The distance from references to the rebar handle.
Returns:
Returns the newly created RebarConstraint.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Constrained rebar isn't a free form rebar element.
-or-
handle is no longer valid.
-or-
targetReferences is empty.
-or-
targetReferences do not represent faces from structurals that can host rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarHandleBehavior
Gets the RebarHandleBehavior of the handle of the other Rebar Element to which this RebarConstraint is attached.
The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar'.
Returns:
Returns the RebarHandleBehavior of the handle of the other Rebar Element to which this RebarConstraint is attached.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
Constrained rebar isn't a shape driven rebar element.
Since:
2026

Autodesk.Revit.DB.Structure.RebarConstraint
A class representing a constraint on a handle of a rebar element.
Remarks:
For Shape Driven Rebar Constraints:
Each handle on a rebar is defined by a plane, and can be constrained along the
direction perpendicular to a surface. Rebar constraints work by locking the
handle planes to targets. These targets can be: surfaces of host elements (faces or cover),
the handle planes of other Rebar element or any generic surface.
A special case is for of a straight, standard style bar, running perpendicular
to the plane of the stirrup bar. This bar can constrain itself to distinct locations
along bends in stirrup bars - points located at 0 degrees, 45 degrees, 90 degrees,
etc. around each bend. This is done by simultaneously locking both the straight
bar's edge handle and its planar position handle to one or both of the stirrup edges
adjacent to the bend in the stirrup.
Usually, to form a constraint, the handle plane and the reference plane must be parallel.
However, bar end or segment handles can be constrained to planes at angles up to 84 degrees.
Arc-shaped rebar is a special case, and can form constraints to concentric host surfaces.
For Free Form Rebar Constraints:
Each handle of the Rebar can be constrained to multiple host faces or to the face cover.
In order to create a Free Form Rebar Constraint you will need:
RebarConstraintsManager which will manage the constraint.  The rebar handle you want to constraint.  A list of target references which must be element faces to which this handle is constrained.  A Boolean value specifying that the constraint is to cover or directly to face. It will be the same value for all target references A double value that represent the  offset distance from the rebar handle to target references.
RebarConstraints for Free Form Rebar should be created using the Create method and then added to
the RebarConstraintsManager using the method SetPreferredConstraint.
Since:
2014